reports/p14-1/read/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /workspace/scripts/read_baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 3m30s max duration (incl. graceful stop):
              * reads: 50.00 iterations/s for 3m0s (maxVUs: 50-200, gracefulStop: 30s)


running (0m01.0s), 000/050 VUs, 50 complete and 0 interrupted iterations
reads   [   1% ] 000/050 VUs  0m01.0s/3m0s  50.00 iters/s

running (0m02.0s), 002/050 VUs, 98 complete and 0 interrupted iterations
reads   [   1% ] 002/050 VUs  0m02.0s/3m0s  50.00 iters/s

running (0m03.0s), 001/050 VUs, 149 complete and 0 interrupted iterations
reads   [   2% ] 001/050 VUs  0m03.0s/3m0s  50.00 iters/s

running (0m04.0s), 000/050 VUs, 200 complete and 0 interrupted iterations
reads   [   2% ] 000/050 VUs  0m04.0s/3m0s  50.00 iters/s

running (0m05.0s), 000/050 VUs, 250 complete and 0 interrupted iterations
reads   [   3% ] 000/050 VUs  0m05.0s/3m0s  50.00 iters/s

running (0m06.0s), 001/050 VUs, 299 complete and 0 interrupted iterations
reads   [   3% ] 001/050 VUs  0m06.0s/3m0s  50.00 iters/s

running (0m07.0s), 001/050 VUs, 349 complete and 0 interrupted iterations
reads   [   4% ] 001/050 VUs  0m07.0s/3m0s  50.00 iters/s

running (0m08.0s), 000/050 VUs, 400 complete and 0 interrupted iterations
reads   [   4% ] 000/050 VUs  0m08.0s/3m0s  50.00 iters/s

running (0m09.0s), 000/050 VUs, 450 complete and 0 interrupted iterations
reads   [   5% ] 000/050 VUs  0m09.0s/3m0s  50.00 iters/s

running (0m10.0s), 001/050 VUs, 499 complete and 0 interrupted iterations
reads   [   6% ] 001/050 VUs  0m10.0s/3m0s  50.00 iters/s

running (0m11.0s), 001/050 VUs, 549 complete and 0 interrupted iterations
reads   [   6% ] 001/050 VUs  0m11.0s/3m0s  50.00 iters/s

running (0m12.0s), 000/050 VUs, 600 complete and 0 interrupted iterations
reads   [   7% ] 000/050 VUs  0m12.0s/3m0s  50.00 iters/s

running (0m13.0s), 000/050 VUs, 650 complete and 0 interrupted iterations
reads   [   7% ] 000/050 VUs  0m13.0s/3m0s  50.00 iters/s

running (0m14.0s), 001/050 VUs, 699 complete and 0 interrupted iterations
reads   [   8% ] 001/050 VUs  0m14.0s/3m0s  50.00 iters/s

running (0m15.0s), 001/050 VUs, 749 complete and 0 interrupted iterations
reads   [   8% ] 001/050 VUs  0m15.0s/3m0s  50.00 iters/s

running (0m16.0s), 000/050 VUs, 800 complete and 0 interrupted iterations
reads   [   9% ] 000/050 VUs  0m16.0s/3m0s  50.00 iters/s

running (0m17.0s), 001/050 VUs, 849 complete and 0 interrupted iterations
reads   [   9% ] 001/050 VUs  0m17.0s/3m0s  50.00 iters/s

running (0m18.0s), 001/050 VUs, 899 complete and 0 interrupted iterations
reads   [  10% ] 001/050 VUs  0m18.0s/3m0s  50.00 iters/s

running (0m19.0s), 001/050 VUs, 949 complete and 0 interrupted iterations
reads   [  11% ] 001/050 VUs  0m19.0s/3m0s  50.00 iters/s

running (0m20.0s), 000/050 VUs, 1000 complete and 0 interrupted iterations
reads   [  11% ] 000/050 VUs  0m20.0s/3m0s  50.00 iters/s

running (0m21.0s), 000/050 VUs, 1050 complete and 0 interrupted iterations
reads   [  12% ] 000/050 VUs  0m21.0s/3m0s  50.00 iters/s

running (0m22.0s), 002/050 VUs, 1098 complete and 0 interrupted iterations
reads   [  12% ] 002/050 VUs  0m22.0s/3m0s  50.00 iters/s

running (0m23.0s), 001/050 VUs, 1149 complete and 0 interrupted iterations
reads   [  13% ] 001/050 VUs  0m23.0s/3m0s  50.00 iters/s

running (0m24.0s), 000/050 VUs, 1200 complete and 0 interrupted iterations
reads   [  13% ] 000/050 VUs  0m24.0s/3m0s  50.00 iters/s

running (0m25.0s), 000/050 VUs, 1250 complete and 0 interrupted iterations
reads   [  14% ] 000/050 VUs  0m25.0s/3m0s  50.00 iters/s

running (0m26.0s), 002/050 VUs, 1298 complete and 0 interrupted iterations
reads   [  14% ] 002/050 VUs  0m26.0s/3m0s  50.00 iters/s

running (0m27.0s), 001/050 VUs, 1349 complete and 0 interrupted iterations
reads   [  15% ] 001/050 VUs  0m27.0s/3m0s  50.00 iters/s

running (0m28.0s), 000/050 VUs, 1400 complete and 0 interrupted iterations
reads   [  16% ] 000/050 VUs  0m28.0s/3m0s  50.00 iters/s

running (0m29.0s), 000/050 VUs, 1450 complete and 0 interrupted iterations
reads   [  16% ] 000/050 VUs  0m29.0s/3m0s  50.00 iters/s

running (0m30.0s), 001/050 VUs, 1499 complete and 0 interrupted iterations
reads   [  17% ] 001/050 VUs  0m30.0s/3m0s  50.00 iters/s

running (0m31.0s), 001/050 VUs, 1549 complete and 0 interrupted iterations
reads   [  17% ] 001/050 VUs  0m31.0s/3m0s  50.00 iters/s

running (0m32.0s), 000/050 VUs, 1600 complete and 0 interrupted iterations
reads   [  18% ] 000/050 VUs  0m32.0s/3m0s  50.00 iters/s

running (0m33.0s), 000/050 VUs, 1650 complete and 0 interrupted iterations
reads   [  18% ] 000/050 VUs  0m33.0s/3m0s  50.00 iters/s

running (0m34.0s), 001/050 VUs, 1699 complete and 0 interrupted iterations
reads   [  19% ] 001/050 VUs  0m34.0s/3m0s  50.00 iters/s

running (0m35.0s), 001/050 VUs, 1749 complete and 0 interrupted iterations
reads   [  19% ] 001/050 VUs  0m35.0s/3m0s  50.00 iters/s

running (0m36.0s), 000/050 VUs, 1800 complete and 0 interrupted iterations
reads   [  20% ] 000/050 VUs  0m36.0s/3m0s  50.00 iters/s

running (0m37.0s), 000/050 VUs, 1850 complete and 0 interrupted iterations
reads   [  21% ] 000/050 VUs  0m37.0s/3m0s  50.00 iters/s

running (0m38.0s), 002/050 VUs, 1898 complete and 0 interrupted iterations
reads   [  21% ] 002/050 VUs  0m38.0s/3m0s  50.00 iters/s

running (0m39.0s), 001/050 VUs, 1949 complete and 0 interrupted iterations
reads   [  22% ] 001/050 VUs  0m39.0s/3m0s  50.00 iters/s

running (0m40.0s), 000/050 VUs, 2000 complete and 0 interrupted iterations
reads   [  22% ] 000/050 VUs  0m40.0s/3m0s  50.00 iters/s

running (0m41.0s), 000/050 VUs, 2050 complete and 0 interrupted iterations
reads   [  23% ] 000/050 VUs  0m41.0s/3m0s  50.00 iters/s

running (0m42.0s), 001/050 VUs, 2099 complete and 0 interrupted iterations
reads   [  23% ] 001/050 VUs  0m42.0s/3m0s  50.00 iters/s

running (0m43.0s), 001/050 VUs, 2149 complete and 0 interrupted iterations
reads   [  24% ] 001/050 VUs  0m43.0s/3m0s  50.00 iters/s

running (0m44.0s), 000/050 VUs, 2200 complete and 0 interrupted iterations
reads   [  24% ] 000/050 VUs  0m44.0s/3m0s  50.00 iters/s

running (0m45.0s), 000/050 VUs, 2250 complete and 0 interrupted iterations
reads   [  25% ] 000/050 VUs  0m45.0s/3m0s  50.00 iters/s

running (0m46.0s), 002/050 VUs, 2298 complete and 0 interrupted iterations
reads   [  26% ] 002/050 VUs  0m46.0s/3m0s  50.00 iters/s

running (0m47.0s), 001/050 VUs, 2349 complete and 0 interrupted iterations
reads   [  26% ] 001/050 VUs  0m47.0s/3m0s  50.00 iters/s

running (0m48.0s), 000/050 VUs, 2400 complete and 0 interrupted iterations
reads   [  27% ] 000/050 VUs  0m48.0s/3m0s  50.00 iters/s

running (0m49.0s), 001/050 VUs, 2449 complete and 0 interrupted iterations
reads   [  27% ] 001/050 VUs  0m49.0s/3m0s  50.00 iters/s

running (0m50.0s), 002/050 VUs, 2498 complete and 0 interrupted iterations
reads   [  28% ] 002/050 VUs  0m50.0s/3m0s  50.00 iters/s

running (0m51.0s), 001/050 VUs, 2549 complete and 0 interrupted iterations
reads   [  28% ] 001/050 VUs  0m51.0s/3m0s  50.00 iters/s

running (0m52.0s), 000/050 VUs, 2600 complete and 0 interrupted iterations
reads   [  29% ] 000/050 VUs  0m52.0s/3m0s  50.00 iters/s

running (0m53.0s), 000/050 VUs, 2650 complete and 0 interrupted iterations
reads   [  29% ] 000/050 VUs  0m53.0s/3m0s  50.00 iters/s

running (0m54.0s), 001/050 VUs, 2699 complete and 0 interrupted iterations
reads   [  30% ] 001/050 VUs  0m54.0s/3m0s  50.00 iters/s

running (0m55.0s), 001/050 VUs, 2749 complete and 0 interrupted iterations
reads   [  31% ] 001/050 VUs  0m55.0s/3m0s  50.00 iters/s

running (0m56.0s), 000/050 VUs, 2800 complete and 0 interrupted iterations
reads   [  31% ] 000/050 VUs  0m56.0s/3m0s  50.00 iters/s

running (0m57.0s), 000/050 VUs, 2850 complete and 0 interrupted iterations
reads   [  32% ] 000/050 VUs  0m57.0s/3m0s  50.00 iters/s

running (0m58.0s), 001/050 VUs, 2899 complete and 0 interrupted iterations
reads   [  32% ] 001/050 VUs  0m58.0s/3m0s  50.00 iters/s

running (0m59.0s), 001/050 VUs, 2949 complete and 0 interrupted iterations
reads   [  33% ] 001/050 VUs  0m59.0s/3m0s  50.00 iters/s

running (1m00.0s), 000/050 VUs, 3000 complete and 0 interrupted iterations
reads   [  33% ] 000/050 VUs  1m00.0s/3m0s  50.00 iters/s

running (1m01.0s), 000/050 VUs, 3050 complete and 0 interrupted iterations
reads   [  34% ] 000/050 VUs  1m01.0s/3m0s  50.00 iters/s

running (1m02.0s), 001/050 VUs, 3099 complete and 0 interrupted iterations
reads   [  34% ] 001/050 VUs  1m02.0s/3m0s  50.00 iters/s

running (1m03.0s), 001/050 VUs, 3149 complete and 0 interrupted iterations
reads   [  35% ] 001/050 VUs  1m03.0s/3m0s  50.00 iters/s

running (1m04.0s), 000/050 VUs, 3200 complete and 0 interrupted iterations
reads   [  36% ] 000/050 VUs  1m04.0s/3m0s  50.00 iters/s

running (1m05.0s), 000/050 VUs, 3250 complete and 0 interrupted iterations
reads   [  36% ] 000/050 VUs  1m05.0s/3m0s  50.00 iters/s

running (1m06.0s), 002/050 VUs, 3298 complete and 0 interrupted iterations
reads   [  37% ] 002/050 VUs  1m06.0s/3m0s  50.00 iters/s

running (1m07.0s), 001/050 VUs, 3349 complete and 0 interrupted iterations
reads   [  37% ] 001/050 VUs  1m07.0s/3m0s  50.00 iters/s

running (1m08.0s), 000/050 VUs, 3400 complete and 0 interrupted iterations
reads   [  38% ] 000/050 VUs  1m08.0s/3m0s  50.00 iters/s

running (1m09.0s), 000/050 VUs, 3450 complete and 0 interrupted iterations
reads   [  38% ] 000/050 VUs  1m09.0s/3m0s  50.00 iters/s

running (1m10.0s), 002/050 VUs, 3498 complete and 0 interrupted iterations
reads   [  39% ] 002/050 VUs  1m10.0s/3m0s  50.00 iters/s

running (1m11.0s), 001/050 VUs, 3549 complete and 0 interrupted iterations
reads   [  39% ] 001/050 VUs  1m11.0s/3m0s  50.00 iters/s

running (1m12.0s), 000/050 VUs, 3600 complete and 0 interrupted iterations
reads   [  40% ] 000/050 VUs  1m12.0s/3m0s  50.00 iters/s

running (1m13.0s), 000/050 VUs, 3650 complete and 0 interrupted iterations
reads   [  41% ] 000/050 VUs  1m13.0s/3m0s  50.00 iters/s

running (1m14.0s), 001/050 VUs, 3699 complete and 0 interrupted iterations
reads   [  41% ] 001/050 VUs  1m14.0s/3m0s  50.00 iters/s

running (1m15.0s), 001/050 VUs, 3749 complete and 0 interrupted iterations
reads   [  42% ] 001/050 VUs  1m15.0s/3m0s  50.00 iters/s

running (1m16.0s), 000/050 VUs, 3800 complete and 0 interrupted iterations
reads   [  42% ] 000/050 VUs  1m16.0s/3m0s  50.00 iters/s

running (1m17.0s), 000/050 VUs, 3850 complete and 0 interrupted iterations
reads   [  43% ] 000/050 VUs  1m17.0s/3m0s  50.00 iters/s

running (1m18.0s), 002/050 VUs, 3898 complete and 0 interrupted iterations
reads   [  43% ] 002/050 VUs  1m18.0s/3m0s  50.00 iters/s

running (1m19.0s), 001/050 VUs, 3949 complete and 0 interrupted iterations
reads   [  44% ] 001/050 VUs  1m19.0s/3m0s  50.00 iters/s

running (1m20.0s), 000/050 VUs, 4000 complete and 0 interrupted iterations
reads   [  44% ] 000/050 VUs  1m20.0s/3m0s  50.00 iters/s

running (1m21.0s), 000/050 VUs, 4050 complete and 0 interrupted iterations
reads   [  45% ] 000/050 VUs  1m21.0s/3m0s  50.00 iters/s

running (1m22.0s), 001/050 VUs, 4099 complete and 0 interrupted iterations
reads   [  46% ] 001/050 VUs  1m22.0s/3m0s  50.00 iters/s

running (1m23.0s), 001/050 VUs, 4149 complete and 0 interrupted iterations
reads   [  46% ] 001/050 VUs  1m23.0s/3m0s  50.00 iters/s

running (1m24.0s), 000/050 VUs, 4200 complete and 0 interrupted iterations
reads   [  47% ] 000/050 VUs  1m24.0s/3m0s  50.00 iters/s

running (1m25.0s), 000/050 VUs, 4250 complete and 0 interrupted iterations
reads   [  47% ] 000/050 VUs  1m25.0s/3m0s  50.00 iters/s

running (1m26.0s), 001/050 VUs, 4299 complete and 0 interrupted iterations
reads   [  48% ] 001/050 VUs  1m26.0s/3m0s  50.00 iters/s

running (1m27.0s), 001/050 VUs, 4349 complete and 0 interrupted iterations
reads   [  48% ] 001/050 VUs  1m27.0s/3m0s  50.00 iters/s

running (1m28.0s), 000/050 VUs, 4400 complete and 0 interrupted iterations
reads   [  49% ] 000/050 VUs  1m28.0s/3m0s  50.00 iters/s

running (1m29.0s), 000/050 VUs, 4450 complete and 0 interrupted iterations
reads   [  49% ] 000/050 VUs  1m29.0s/3m0s  50.00 iters/s

running (1m30.0s), 001/050 VUs, 4499 complete and 0 interrupted iterations
reads   [  50% ] 001/050 VUs  1m30.0s/3m0s  50.00 iters/s

running (1m31.0s), 001/050 VUs, 4549 complete and 0 interrupted iterations
reads   [  51% ] 001/050 VUs  1m31.0s/3m0s  50.00 iters/s

running (1m32.0s), 000/050 VUs, 4600 complete and 0 interrupted iterations
reads   [  51% ] 000/050 VUs  1m32.0s/3m0s  50.00 iters/s

running (1m33.0s), 001/050 VUs, 4649 complete and 0 interrupted iterations
reads   [  52% ] 001/050 VUs  1m33.0s/3m0s  50.00 iters/s

running (1m34.0s), 001/050 VUs, 4699 complete and 0 interrupted iterations
reads   [  52% ] 001/050 VUs  1m34.0s/3m0s  50.00 iters/s

running (1m35.0s), 001/050 VUs, 4749 complete and 0 interrupted iterations
reads   [  53% ] 001/050 VUs  1m35.0s/3m0s  50.00 iters/s

running (1m36.0s), 000/050 VUs, 4800 complete and 0 interrupted iterations
reads   [  53% ] 000/050 VUs  1m36.0s/3m0s  50.00 iters/s

running (1m37.0s), 000/050 VUs, 4850 complete and 0 interrupted iterations
reads   [  54% ] 000/050 VUs  1m37.0s/3m0s  50.00 iters/s

running (1m38.0s), 002/050 VUs, 4898 complete and 0 interrupted iterations
reads   [  54% ] 002/050 VUs  1m38.0s/3m0s  50.00 iters/s

running (1m39.0s), 001/050 VUs, 4949 complete and 0 interrupted iterations
reads   [  55% ] 001/050 VUs  1m39.0s/3m0s  50.00 iters/s

running (1m40.0s), 000/050 VUs, 5000 complete and 0 interrupted iterations
reads   [  56% ] 000/050 VUs  1m40.0s/3m0s  50.00 iters/s

running (1m41.0s), 000/050 VUs, 5050 complete and 0 interrupted iterations
reads   [  56% ] 000/050 VUs  1m41.0s/3m0s  50.00 iters/s

running (1m42.0s), 002/050 VUs, 5098 complete and 0 interrupted iterations
reads   [  57% ] 002/050 VUs  1m42.0s/3m0s  50.00 iters/s

running (1m43.0s), 001/050 VUs, 5149 complete and 0 interrupted iterations
reads   [  57% ] 001/050 VUs  1m43.0s/3m0s  50.00 iters/s

running (1m44.0s), 000/050 VUs, 5200 complete and 0 interrupted iterations
reads   [  58% ] 000/050 VUs  1m44.0s/3m0s  50.00 iters/s

running (1m45.0s), 000/050 VUs, 5250 complete and 0 interrupted iterations
reads   [  58% ] 000/050 VUs  1m45.0s/3m0s  50.00 iters/s

running (1m46.0s), 001/050 VUs, 5299 complete and 0 interrupted iterations
reads   [  59% ] 001/050 VUs  1m46.0s/3m0s  50.00 iters/s

running (1m47.0s), 001/050 VUs, 5349 complete and 0 interrupted iterations
reads   [  59% ] 001/050 VUs  1m47.0s/3m0s  50.00 iters/s

running (1m48.0s), 000/050 VUs, 5400 complete and 0 interrupted iterations
reads   [  60% ] 000/050 VUs  1m48.0s/3m0s  50.00 iters/s

running (1m49.0s), 000/050 VUs, 5450 complete and 0 interrupted iterations
reads   [  61% ] 000/050 VUs  1m49.0s/3m0s  50.00 iters/s

running (1m50.0s), 002/050 VUs, 5498 complete and 0 interrupted iterations
reads   [  61% ] 002/050 VUs  1m50.0s/3m0s  50.00 iters/s

running (1m51.0s), 001/050 VUs, 5549 complete and 0 interrupted iterations
reads   [  62% ] 001/050 VUs  1m51.0s/3m0s  50.00 iters/s

running (1m52.0s), 000/050 VUs, 5600 complete and 0 interrupted iterations
reads   [  62% ] 000/050 VUs  1m52.0s/3m0s  50.00 iters/s

running (1m53.0s), 000/050 VUs, 5650 complete and 0 interrupted iterations
reads   [  63% ] 000/050 VUs  1m53.0s/3m0s  50.00 iters/s

running (1m54.0s), 001/050 VUs, 5699 complete and 0 interrupted iterations
reads   [  63% ] 001/050 VUs  1m54.0s/3m0s  50.00 iters/s

running (1m55.0s), 001/050 VUs, 5749 complete and 0 interrupted iterations
reads   [  64% ] 001/050 VUs  1m55.0s/3m0s  50.00 iters/s

running (1m56.0s), 000/050 VUs, 5800 complete and 0 interrupted iterations
reads   [  64% ] 000/050 VUs  1m56.0s/3m0s  50.00 iters/s

running (1m57.0s), 000/050 VUs, 5850 complete and 0 interrupted iterations
reads   [  65% ] 000/050 VUs  1m57.0s/3m0s  50.00 iters/s

running (1m58.0s), 001/050 VUs, 5899 complete and 0 interrupted iterations
reads   [  66% ] 001/050 VUs  1m58.0s/3m0s  50.00 iters/s

running (1m59.0s), 001/050 VUs, 5949 complete and 0 interrupted iterations
reads   [  66% ] 001/050 VUs  1m59.0s/3m0s  50.00 iters/s

running (2m00.0s), 000/050 VUs, 6000 complete and 0 interrupted iterations
reads   [  67% ] 000/050 VUs  2m00.0s/3m0s  50.00 iters/s

running (2m01.0s), 000/050 VUs, 6050 complete and 0 interrupted iterations
reads   [  67% ] 000/050 VUs  2m01.0s/3m0s  50.00 iters/s

running (2m02.0s), 002/050 VUs, 6098 complete and 0 interrupted iterations
reads   [  68% ] 002/050 VUs  2m02.0s/3m0s  50.00 iters/s

running (2m03.0s), 001/050 VUs, 6149 complete and 0 interrupted iterations
reads   [  68% ] 001/050 VUs  2m03.0s/3m0s  50.00 iters/s

running (2m04.0s), 000/050 VUs, 6200 complete and 0 interrupted iterations
reads   [  69% ] 000/050 VUs  2m04.0s/3m0s  50.00 iters/s

running (2m05.0s), 000/050 VUs, 6250 complete and 0 interrupted iterations
reads   [  69% ] 000/050 VUs  2m05.0s/3m0s  50.00 iters/s

running (2m06.0s), 001/050 VUs, 6299 complete and 0 interrupted iterations
reads   [  70% ] 001/050 VUs  2m06.0s/3m0s  50.00 iters/s

running (2m07.0s), 001/050 VUs, 6349 complete and 0 interrupted iterations
reads   [  71% ] 001/050 VUs  2m07.0s/3m0s  50.00 iters/s

running (2m08.0s), 000/050 VUs, 6400 complete and 0 interrupted iterations
reads   [  71% ] 000/050 VUs  2m08.0s/3m0s  50.00 iters/s

running (2m09.0s), 001/050 VUs, 6449 complete and 0 interrupted iterations
reads   [  72% ] 001/050 VUs  2m09.0s/3m0s  50.00 iters/s

running (2m10.0s), 001/050 VUs, 6499 complete and 0 interrupted iterations
reads   [  72% ] 001/050 VUs  2m10.0s/3m0s  50.00 iters/s

running (2m11.0s), 001/050 VUs, 6549 complete and 0 interrupted iterations
reads   [  73% ] 001/050 VUs  2m11.0s/3m0s  50.00 iters/s

running (2m12.0s), 000/050 VUs, 6600 complete and 0 interrupted iterations
reads   [  73% ] 000/050 VUs  2m12.0s/3m0s  50.00 iters/s

running (2m13.0s), 000/050 VUs, 6650 complete and 0 interrupted iterations
reads   [  74% ] 000/050 VUs  2m13.0s/3m0s  50.00 iters/s

running (2m14.0s), 001/050 VUs, 6699 complete and 0 interrupted iterations
reads   [  74% ] 001/050 VUs  2m14.0s/3m0s  50.00 iters/s

running (2m15.0s), 001/050 VUs, 6749 complete and 0 interrupted iterations
reads   [  75% ] 001/050 VUs  2m15.0s/3m0s  50.00 iters/s

running (2m16.0s), 000/050 VUs, 6800 complete and 0 interrupted iterations
reads   [  76% ] 000/050 VUs  2m16.0s/3m0s  50.00 iters/s

running (2m17.0s), 000/050 VUs, 6850 complete and 0 interrupted iterations
reads   [  76% ] 000/050 VUs  2m17.0s/3m0s  50.00 iters/s

running (2m18.0s), 001/050 VUs, 6899 complete and 0 interrupted iterations
reads   [  77% ] 001/050 VUs  2m18.0s/3m0s  50.00 iters/s

running (2m19.0s), 001/050 VUs, 6949 complete and 0 interrupted iterations
reads   [  77% ] 001/050 VUs  2m19.0s/3m0s  50.00 iters/s

running (2m20.0s), 000/050 VUs, 7000 complete and 0 interrupted iterations
reads   [  78% ] 000/050 VUs  2m20.0s/3m0s  50.00 iters/s

running (2m21.0s), 000/050 VUs, 7050 complete and 0 interrupted iterations
reads   [  78% ] 000/050 VUs  2m21.0s/3m0s  50.00 iters/s

running (2m22.0s), 001/050 VUs, 7099 complete and 0 interrupted iterations
reads   [  79% ] 001/050 VUs  2m22.0s/3m0s  50.00 iters/s

running (2m23.0s), 001/050 VUs, 7149 complete and 0 interrupted iterations
reads   [  79% ] 001/050 VUs  2m23.0s/3m0s  50.00 iters/s

running (2m24.0s), 000/050 VUs, 7200 complete and 0 interrupted iterations
reads   [  80% ] 000/050 VUs  2m24.0s/3m0s  50.00 iters/s

running (2m25.0s), 000/050 VUs, 7250 complete and 0 interrupted iterations
reads   [  81% ] 000/050 VUs  2m25.0s/3m0s  50.00 iters/s

running (2m26.0s), 002/050 VUs, 7298 complete and 0 interrupted iterations
reads   [  81% ] 002/050 VUs  2m26.0s/3m0s  50.00 iters/s

running (2m27.0s), 001/050 VUs, 7349 complete and 0 interrupted iterations
reads   [  82% ] 001/050 VUs  2m27.0s/3m0s  50.00 iters/s

running (2m28.0s), 000/050 VUs, 7400 complete and 0 interrupted iterations
reads   [  82% ] 000/050 VUs  2m28.0s/3m0s  50.00 iters/s

running (2m29.0s), 000/050 VUs, 7450 complete and 0 interrupted iterations
reads   [  83% ] 000/050 VUs  2m29.0s/3m0s  50.00 iters/s

running (2m30.0s), 001/050 VUs, 7499 complete and 0 interrupted iterations
reads   [  83% ] 001/050 VUs  2m30.0s/3m0s  50.00 iters/s

running (2m31.0s), 001/050 VUs, 7549 complete and 0 interrupted iterations
reads   [  84% ] 001/050 VUs  2m31.0s/3m0s  50.00 iters/s

running (2m32.0s), 000/050 VUs, 7600 complete and 0 interrupted iterations
reads   [  84% ] 000/050 VUs  2m32.0s/3m0s  50.00 iters/s

running (2m33.0s), 000/050 VUs, 7650 complete and 0 interrupted iterations
reads   [  85% ] 000/050 VUs  2m33.0s/3m0s  50.00 iters/s

running (2m34.0s), 001/050 VUs, 7699 complete and 0 interrupted iterations
reads   [  86% ] 001/050 VUs  2m34.0s/3m0s  50.00 iters/s

running (2m35.0s), 001/050 VUs, 7749 complete and 0 interrupted iterations
reads   [  86% ] 001/050 VUs  2m35.0s/3m0s  50.00 iters/s

running (2m36.0s), 000/050 VUs, 7800 complete and 0 interrupted iterations
reads   [  87% ] 000/050 VUs  2m36.0s/3m0s  50.00 iters/s

running (2m37.0s), 000/050 VUs, 7850 complete and 0 interrupted iterations
reads   [  87% ] 000/050 VUs  2m37.0s/3m0s  50.00 iters/s

running (2m38.0s), 001/050 VUs, 7899 complete and 0 interrupted iterations
reads   [  88% ] 001/050 VUs  2m38.0s/3m0s  50.00 iters/s

running (2m39.0s), 001/050 VUs, 7949 complete and 0 interrupted iterations
reads   [  88% ] 001/050 VUs  2m39.0s/3m0s  50.00 iters/s

running (2m40.0s), 000/050 VUs, 8000 complete and 0 interrupted iterations
reads   [  89% ] 000/050 VUs  2m40.0s/3m0s  50.00 iters/s

running (2m41.0s), 001/050 VUs, 8049 complete and 0 interrupted iterations
reads   [  89% ] 001/050 VUs  2m41.0s/3m0s  50.00 iters/s

running (2m42.0s), 001/050 VUs, 8099 complete and 0 interrupted iterations
reads   [  90% ] 001/050 VUs  2m42.0s/3m0s  50.00 iters/s

running (2m43.0s), 001/050 VUs, 8149 complete and 0 interrupted iterations
reads   [  91% ] 001/050 VUs  2m43.0s/3m0s  50.00 iters/s

running (2m44.0s), 000/050 VUs, 8200 complete and 0 interrupted iterations
reads   [  91% ] 000/050 VUs  2m44.0s/3m0s  50.00 iters/s

running (2m45.0s), 000/050 VUs, 8250 complete and 0 interrupted iterations
reads   [  92% ] 000/050 VUs  2m45.0s/3m0s  50.00 iters/s

running (2m46.0s), 002/050 VUs, 8298 complete and 0 interrupted iterations
reads   [  92% ] 002/050 VUs  2m46.0s/3m0s  50.00 iters/s

running (2m47.0s), 001/050 VUs, 8349 complete and 0 interrupted iterations
reads   [  93% ] 001/050 VUs  2m47.0s/3m0s  50.00 iters/s

running (2m48.0s), 000/050 VUs, 8400 complete and 0 interrupted iterations
reads   [  93% ] 000/050 VUs  2m48.0s/3m0s  50.00 iters/s

running (2m49.0s), 000/050 VUs, 8450 complete and 0 interrupted iterations
reads   [  94% ] 000/050 VUs  2m49.0s/3m0s  50.00 iters/s

running (2m50.0s), 001/050 VUs, 8499 complete and 0 interrupted iterations
reads   [  94% ] 001/050 VUs  2m50.0s/3m0s  50.00 iters/s

running (2m51.0s), 001/050 VUs, 8549 complete and 0 interrupted iterations
reads   [  95% ] 001/050 VUs  2m51.0s/3m0s  50.00 iters/s

running (2m52.0s), 000/050 VUs, 8600 complete and 0 interrupted iterations
reads   [  96% ] 000/050 VUs  2m52.0s/3m0s  50.00 iters/s

running (2m53.0s), 000/050 VUs, 8650 complete and 0 interrupted iterations
reads   [  96% ] 000/050 VUs  2m53.0s/3m0s  50.00 iters/s

running (2m54.0s), 001/050 VUs, 8699 complete and 0 interrupted iterations
reads   [  97% ] 001/050 VUs  2m54.0s/3m0s  50.00 iters/s

running (2m55.0s), 001/050 VUs, 8749 complete and 0 interrupted iterations
reads   [  97% ] 001/050 VUs  2m55.0s/3m0s  50.00 iters/s

running (2m56.0s), 000/050 VUs, 8800 complete and 0 interrupted iterations
reads   [  98% ] 000/050 VUs  2m56.0s/3m0s  50.00 iters/s

running (2m57.0s), 000/050 VUs, 8850 complete and 0 interrupted iterations
reads   [  98% ] 000/050 VUs  2m57.0s/3m0s  50.00 iters/s

running (2m58.0s), 001/050 VUs, 8899 complete and 0 interrupted iterations
reads   [  99% ] 001/050 VUs  2m58.0s/3m0s  50.00 iters/s

running (2m59.0s), 001/050 VUs, 8949 complete and 0 interrupted iterations
reads   [  99% ] 001/050 VUs  2m59.0s/3m0s  50.00 iters/s

running (3m00.0s), 000/050 VUs, 9000 complete and 0 interrupted iterations
reads   [ 100% ] 000/050 VUs  3m00.0s/3m0s  50.00 iters/s

     ✓ HTTP 200
     ✓ Result success

     checks.........................: 100.00% 18002 out of 18002
   ✓ contract_errors................: 0.00%   0 out of 9001
     data_received..................: 162 MB  900 kB/s
     data_sent......................: 1.1 MB  6.1 kB/s
     http_req_blocked...............: avg=3.23µs  min=708ns    med=1.45µs  max=2.23ms   p(90)=2.75µs   p(95)=3.5µs    p(99)=69.7µs  
     http_req_connecting............: avg=860ns   min=0s       med=0s      max=326.58µs p(90)=0s       p(95)=0s       p(99)=47.33µs 
   ✓ http_req_duration..............: avg=11.36ms min=408.12µs med=3.89ms  max=81.72ms  p(90)=69.6ms   p(95)=70.51ms  p(99)=71.91ms 
       { expected_response:true }...: avg=11.36ms min=408.12µs med=3.89ms  max=81.72ms  p(90)=69.6ms   p(95)=70.51ms  p(99)=71.91ms 
   ✓ http_req_failed................: 0.00%   0 out of 9001
     http_req_receiving.............: avg=48.63µs min=8.7µs    med=20.95µs max=1.24ms   p(90)=156.66µs p(95)=173.29µs p(99)=207.62µs
     http_req_sending...............: avg=8.95µs  min=2.25µs   med=7.91µs  max=489.29µs p(90)=12.5µs   p(95)=14.95µs  p(99)=25.2µs  
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=11.3ms  min=389.5µs  med=3.8ms   max=81.48ms  p(90)=69.41ms  p(95)=70.33ms  p(99)=71.73ms 
     http_reqs......................: 9001    50.004592/s
     iteration_duration.............: avg=11.45ms min=449.12µs med=4ms     max=82.45ms  p(90)=69.74ms  p(95)=70.67ms  p(99)=72.07ms 
     iterations.....................: 9001    50.004592/s
     vus............................: 0       min=0              max=2 
     vus_max........................: 50      min=50             max=50


running (3m00.0s), 000/050 VUs, 9001 complete and 0 interrupted iterations
reads ✓ [ 100% ] 000/050 VUs  3m0s  50.00 iters/s